<template>
<div>
  <div id="v-line">
    <h3>基本折线图</h3>
    <ve-line :data="chartData"></ve-line>
  </div>
  <div id="v-line">
    <h3>柱状图</h3>
    <ve-histogram :data="chartData"></ve-histogram>
  </div>
  <div id="v-line">
    <h3>饼图</h3>
    <ve-pie :data="pieChartData"></ve-pie>
  </div>
</div>
</template>

<script>
//https://v-charts.js.org/#/
export default {
  components: {

  },
  data() {
    return {
      chartData: {
        columns: ['日期', '访问用户', '下单用户', '下单率'],
        rows: [{
            '日期': '1/1',
            '访问用户': 1393,
            '下单用户': 1093,
            '下单率': 0.32
          },
          {
            '日期': '1/2',
            '访问用户': 3530,
            '下单用户': 3230,
            '下单率': 0.26
          },
          {
            '日期': '1/3',
            '访问用户': 2923,
            '下单用户': 2623,
            '下单率': 0.76
          },
          {
            '日期': '1/4',
            '访问用户': 1723,
            '下单用户': 1423,
            '下单率': 0.49
          },
          {
            '日期': '1/5',
            '访问用户': 3792,
            '下单用户': 3492,
            '下单率': 0.323
          },
          {
            '日期': '1/6',
            '访问用户': 4593,
            '下单用户': 4293,
            '下单率': 0.78
          }
        ]
      },
      pieChartData: {
          columns: ['日期', '访问用户'],
          rows: [
            { '日期': '1/1', '访问用户': 1393 },
            { '日期': '1/2', '访问用户': 3530 },
            { '日期': '1/3', '访问用户': 2923 },
            { '日期': '1/4', '访问用户': 1723 },
            { '日期': '1/5', '访问用户': 3792 },
            { '日期': '1/6', '访问用户': 4593 }
          ]
        }
    };
  }
}
</script>
